Revit 2027 API
SkyBackgroundSettings Class
 Represents the rendering sky background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.SkyBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SkyBackgroundSettings : BackgroundSettings
Public Class SkyBackgroundSettings
	Inherits BackgroundSettings
public ref class SkyBackgroundSettings : public BackgroundSettings
type SkyBackgroundSettings =
    class
        inherit BackgroundSettings
    end
The SkyBackgroundSettings type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BackgroundSettings)
Top
Methods
Name | Description
Dispose
(Inherited from BackgroundSettings)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace